## Commonly used data Format is Excel or CSV
### -> here data is stored in the form of tables, every row is called record, and every column has same datatype.

## Comma - Seperated values
   
   ### -> Format ".csv"
   #### each record is seperated by comma
   #### files where records are seperated by tab are called tab seperated values
   
## Excel -> format ".xlsx"

## Pandas -> library to work with data frames

In [5]:
pip install pandas

import pandas as pd

In [28]:
data_csv=pd.read_csv('/Users/shreddyr/Downloads/results.csv')

In [30]:
data_csv.head(10)

,home_team,away_team,home_goals,away_goals,result,season
0,Sheffield United,Liverpool,1.0,1.0,D,2006-2007
1,Arsenal,Aston Villa,1.0,1.0,D,2006-2007
2,Everton,Watford,2.0,1.0,H,2006-2007
3,Newcastle United,Wigan Athletic,2.0,1.0,H,2006-2007
4,Portsmouth,Blackburn Rovers,3.0,0.0,H,2006-2007
5,Reading,Middlesbrough,3.0,2.0,H,2006-2007
6,West Ham United,Charlton Athletic,3.0,1.0,H,2006-2007
7,Bolton Wanderers,Tottenham Hotspur,2.0,0.0,H,2006-2007
8,Manchester United,Fulham,5.0,1.0,H,2006-2007
9,Chelsea,Manchester City,3.0,0.0,H,2006-2007

#### When we read a file all the blank cells will be read as "nan"

### How to remove the index column that was printed in the aboce csv data?

In [9]:
data_csv=pd.read_csv('/Users/shreddyr/Downloads/results.csv', index_col=0)

data_csv.head()

                         away_team  home_goals  away_goals result     season
home_team
Sheffield United         Liverpool         1.0         1.0      D  2006-2007
Arsenal                Aston Villa         1.0         1.0      D  2006-2007
Everton                    Watford         2.0         1.0      H  2006-2007
Newcastle United    Wigan Athletic         2.0         1.0      H  2006-2007
Portsmouth        Blackburn Rovers         3.0         0.0      H  2006-2007

### Read from excel file

In [11]:
pip install openpyxl

Collecting openpyxl
  Downloading openpyxl-3.1.2-py2.py3-none-any.whl (249 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 250.0/250.0 kB 117.0 kB/s eta 0:00:0000:0100:01
Collecting et-xmlfile (from openpyxl)
  Downloading et_xmlfile-1.1.0-py3-none-any.whl (4.7 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-1.1.0 openpyxl-3.1.2
Note: you may need to restart the kernel to use updated packages.

In [31]:
data_xlsx=pd.read_excel('/Users/shreddyr/Downloads/Book1.xlsx')

data_xlsx.head()

,Time Range,Total Time duration,Description,Date,Unnamed: 4,Goals
0,01:30:00,NaN,Wprk (quilt pipelines),2023-03-03,Friday,NaN
1,02:10:00,NaN,eat and washroom,NaT,NaN,NaN
2,02:35:00,NaN,work (quilt pipelines),NaT,NaN,NaN
3,03:15:00,NaN,building package,NaT,NaN,NaN
4,03:30:00,NaN,sruthi meet,NaT,NaN,NaN

### Read from text file

In [14]:
data_txt=pd.read_table('/Users/shreddyr/Downloads/textdataexample.txt')

In [15]:
data_txt.head()

  SCAC*,ACCOUNT_NUMBER*,INV_NUMBER*,INV_DATE*,INV_TOTAL_AMT*, INV_BASE_AMT* ,INV_BARCODE*,INV_TAX_1_NAME*,INV_TAX_1_PERCENTAGE*, INV_TAX_1_AMOUNT* , INV_TAX_1_TAXABLE_AMOUNT* ,INV_TAX_2_NAME,INV_TAX_2_PERCENTAGE,INV_TAX_2_AMOUNT,INV_TAX_2_TAXABLE_AMOUNT,INV_TAX_3_NAME,INV_TAX_3_PERCENTAGE,INV_TAX_3_AMOUNT,INV_TAX_3_TAXABLE_AMOUNT,CURRENCY_CODE*,AMAZON_REF_ID*,CARRIER_REF_ID,AMAZON_VAT_ID*,CARRIER_VAT_ID*,SHIPPER_ACCOUNT,BILL_NAME,BILL_COMPANY*,BILL_ADDRESS_LINE_1*,BILL_ADDRESS_LINE_2,BILL_CITY*,BILL_STATE,BILL_COUNTRY_CODE*,BILL_POSTAL_CODE*,FROM_NAME,CARRIER_COMPANY,CARRIER_ADDRESS_LINE_1,FROM_ADDRESS_LINE_2,CARRIER_CITY,FROM_STATE,CARRIER_COUNTRY_CODE,CARRIER_POSTAL_CODE,PICKUP_DATE*,PICKUP_POINT*,DELIVERED_DATE,DELIVERED_POINT*,CONSIGMENT,ITEM_CLASS,VEHICLE_TYPE,DISTANCE,DISTANCE_UNIT,STOP_OVERS,CHARGE_1_CODE*,CHARGE_1_AMOUNT*,CHARGE_1_TAX_1_NAME,CHARGE_1_TAX_1_PERCENTAGE,CHARGE_1_TAX_1_AMOUNT,CHARGE_1_TAX_1_TAXABLE_AMOUNT,CHARGE_1_TAX_2_NAME,CHARGE_1_TAX_2_PERCENTAGE,CHARGE_1_TAX_2_AMOUNT,CHARGE_1_TAX_2_TAXABLE_AMOUNT,CHARGE_2_CODE*,CHARGE_2_AMOUNT*,CHARGE_2_TAX_1_NAME,CHARGE_2_TAX_1_PERCENTAGE,CHARGE_2_TAX_1_AMOUNT,CHARGE_2_TAX_1_TAXABLE_AMOUNT,CHARGE_2_TAX_2_NAME,CHARGE_2_TAX_2_PERCENTAGE,CHARGE_2_TAX_2_AMOUNT,CHARGE_2_TAX_2_TAXABLE_AMOUNT,CHARGE_3_CODE*,CHARGE_3_AMOUNT*,CHARGE_3_TAX_1_NAME,CHARGE_3_TAX_1_PERCENTAGE,CHARGE_3_TAX_1_AMOUNT,CHARGE_3_TAX_1_TAXABLE_AMOUNT,CHARGE_3_TAX_2_NAME,CHARGE_3_TAX_2_PERCENTAGE,CHARGE_3_TAX_2_AMOUNT,CHARGE_3_TAX_2_TAXABLE_AMOUNT
0  ASLI,ASLIAIRCARGO,7022002523,20221206,24223.68...

### All the columns are stored as the name of a single column in a dataframe.
### to avoid this we need to provide parameters called "delimiter" or "sep"

## If you open your text file you can see that they are seperated by comma, so the delimiter will be comma

In [34]:
data_txt=pd.read_table('/Users/shreddyr/Downloads/textdataexample.txt', delimiter=",")

#get the first 5 rows
# and columns from 25 to 30

data_txt.iloc[:5, 25:31]

,BILL_NAME,BILL_COMPANY*,BILL_ADDRESS_LINE_1*,BILL_ADDRESS_LINE_2,BILL_CITY*,BILL_STATE
0,NaN,AMAZON EU SARL NIEDERLASSUNG DEUTSCHLAND,MARCEL-BREUER-STR. 12,NaN,MUNCHEN,NaN